# More Practice with split

In [10]:
import pandas as pd

In [13]:
%%HTML
<style>
    table.dataframe th,table.dataframe td{
        border:1px solid black;
        text-align:left;
        background-color:white;
        color:black;
    }
</style>

In [12]:
chicago = pd.read_csv('../chicago.csv').dropna(how='all')
chicago['Department'] = chicago['Department'].astype('category')
chicago.tail(3)

,Name,Position Title,Department,Employee Annual Salary
32059,"ZYMANTAS, MARK E",POLICE OFFICER,POLICE,$84450.00
32060,"ZYRKOWSKI, CARLO E",POLICE OFFICER,POLICE,$87384.00
32061,"ZYSKOWSKI, DARIUSZ",CHIEF DATA BASE ANALYST,DoIT,$113664.00

In [18]:
chicago['Name'].str.split(',').str.get(0).str.title()

0            Aaron
1            Aaron
2            Aaron
3            Aaron
4          Abad Jr
           ...
32057      Zygadlo
32058     Zygowicz
32059     Zymantas
32060    Zyrkowski
32061    Zyskowski
Name: Name, Length: 32062, dtype: object

In [28]:
chicago['Name'].str.split(',').str.get(1).str.strip().str.split(' ').str.get(0).str.title().value_counts()

Michael    1153
John        899
James       676
Robert      622
Joseph      537
           ...
Lashena       1
Gentral       1
Quanita       1
Para          1
Betra         1
Name: Name, Length: 5091, dtype: int64